---
kind: type
id: T:Autodesk.Revit.DB.PointOnCurveMeasureFrom
source: html/144dc931-4f06-cb80-2b6b-8479ab21920a.htm
---
# Autodesk.Revit.DB.PointOnCurveMeasureFrom

Point on curve MeasureFrom - It tells from which end of the host curve the point location is measured.

## Syntax (C#)
```csharp
public enum PointOnCurveMeasureFrom
```